# 3.
# Узнайте у пользователя число n.
# Найдите сумму чисел n + nn + nnn.
# Например, пользователь ввёл число 3.
# Считаем 3 + 33 + 333 = 369.

n = input("введите число n: ")

print("n + nn + nnn =", int(3n) + int(n*2) + int(n*3))


