"""
3.
Реализовать программу работы с органическими клетками, состоящими из ячеек. Необходимо создать класс Клетка. В его конструкторе инициализировать параметр,
соответствующий количеству ячеек клетки (целое число). В классе должны быть реализованы методы перегрузки арифметических операторов:
сложение ( __add__() ), вычитание ( __sub__() ),
умножение ( __mul__() ), деление ( __truediv__() ).
Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение, умножение и целочисленное (с округлением до целого) деление клеток, соответственно.
Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность количества ячеек двух клеток больше нуля, иначе выводить соответствующее сообщение.
Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как произведение количества ячеек этих двух клеток.
Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление количества ячеек этих двух клеток.

В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
Данный метод позволяет организовать ячейки по рядам. Метод должен возвращать строку вида *****\n*****\n***** ...,
где количество ячеек между \n равно переданному аргументу.
Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5.
Тогда метод make_order() вернет строку: *****\n*****\n** .
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5.
Тогда метод make_order() вернет строку: *****\n*****\n***** .
"""


class Cell:

    def __init__(self, n):
        self.cells = n

    def __add__(self, other):
        return Cell(self.cells + other.cells)

    def __sub__(self, other):
        """
        Условие задачи про вычитание не очень точно сформулирвано в части возврата результата.
        Сделал по аналогии с другими операциями.
        В моей реализации возвращается общий объект Клетка, в котором кол-во клеток равно a - b если оно > 0
        В противном случае выводится сообщение и возвращаеется результат 0.
        :param other:
        :return:
        """
        result = self.cells - other.cells
        if result > 0:
            return Cell(result)
        else:
            print('Вычитание невозможно')
            return 0

    def __mul__(self, other):
        return Cell(self.cells * other.cells)

    def __truediv__(self, other):
        return Cell(int(self.cells / other.cells))

    def __str__(self):
        return str(self.cells)

    def make_order(self, n: int):
        cc = self.cells
        if n >= 1:
            return ('*' * n + '\n') * int(cc / n) + '*' * int(cc % n)
        else:
            return 'n должно быть больше 1'

    @property
    def cell(self):
        return self.cells

    @cell.setter
    def cell(self, n):
        self.cells = n


# проверка класса

a = Cell(10)
b = Cell(5)
print(f'a + b = {a + b}, тип {type(a + b)}')
print(f'a - b = {a - b}, тип {type(a - b)}')
print(f'a * b = {a * b}, тип {type(a * b)}')
print(f'a / b = {a / b}, тип {type(a / b)}')

c = Cell(7)
d = Cell(10)
print(f'c - d = {c - d}')

print(f'\nc.cell = {c}, с.make_order(4):\n{c.make_order(4)}')
print(f'\nc.cell = {c}, с.make_order(6):\n{c.make_order(6)}')
print(f'\nc.cell = {c}, с.make_order(8):\n{c.make_order(8)}')
print(f'\nc.cell = {c}, с.make_order(0):\n{c.make_order(0)}')
